// При GET-запросе списка тем /info/themes
// сервер передаёт json с информацией о имеющихся темах задач
// в виде иерархии вложенных объектов
// и массив всех зарегистрированных пользователей

const themesGet = {
  "themes": [
    {
      "id": 1,
      "name": "Theme 1",
      "themes": [
        {
          "id": 2,
          "name": "Theme 1.1",
          "themes": [
            {
              "id": 3,
              "name": "Theme 1.1.1"
            }
          ]
        },
        {
          "id": 4,
          "name": "Theme 1.2"
        }
      ]
    },
    {
      "id": 5,
      "name": "Theme 2"
    }
  ]
};
